app/controllers/todos_controller.rb

  def index
    @todos = Todo.all
    if params[:is_done].present?
      if params[:is_done] == "true"
        @todos = @todos.where(:is_done => true)
---
SELECT "todos".* FROM "todos" WHERE (is_done like '%true%')
SELECT "todos".* FROM "todos" WHERE "todos"."is_done" = 't'

  def create
    @todo = Todo.new(todo_params)

    respond_to do |format|
      if @todo.save
---
INSERT INTO "todos" ("content", "is_done", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "yaaa"], ["is_done", "f"], ["created_at", "2015-04-16 04:24:07.301163"], ["updated_at", "2015-04-16 04:24:07.301163"]]

  def update
    respond_to do |format|
      if @todo.update(todo_params)
---
UPDATE "todos" SET "content" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["content", "ㄝㄛ"], ["updated_at", "2015-04-16 05:51:05.616256"], ["id", 7]]

  def done
    @todo = Todo.find(params[:id])
    if @todo.is_done
      @todo.update_attributes(is_done: false)
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "todos" SET "is_done" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["is_done", "t"], ["updated_at", "2015-04-16 05:09:38.908113"], ["id", 2]]